{
"HeadingText":"Install SQL Server",
"ContentText":["1.Download latest SQL Enterprise version from https://www.microsoft.com/en-in/sql-server/sql-server-downloads",
               "2.From the root folder, double-click Setup.exe.",
               "3.The Installation Wizard runs the SQL Server Installation Center.",
               "4.To create a new installation of SQL Server, select Installation in the left navigation area, and then select New SQL Server standalone installation or add features to an existing installation.",
               "5.On the Product Key page, select an option to indicate whether you're installing a free edition of SQL Server or a production version that has a PID key. For more information, see Editions and supported features of SQL Server 2017.",
               "6.To continue, select Next.",
               "7.On the License Terms page, review the license agreement. If you agree, select the I accept the license terms and privacy statement check box, and then select Next.",
               "8.In the Global Rules page, Setup will automatically advance to the Product Updates page if there are no rule errors.",
               "9.The Microsoft Update page will appear next if the Microsoft Update check box in Control Panel-> All Control Panel Items -> Windows Update -> Change settings isn't selected. Selecting the Microsoft Update check box changes the computer settings to include the latest updates for all Microsoft products when you scan for Windows updates.",
               "10.On the Product Updates page, the latest available SQL Server product updates are displayed. If no product updates are discovered, Setup doesn't display this page and automatically advances to the Install Setup Files page.",
               "11.On the Install Setup Files page, Setup provides the progress of downloading, extracting, and installing the Setup files. If an update for Setup is found and you specify to include it, that update will also be installed. If no update is found, Setup will automatically advance.",
               "12.On the Install Rules page, Setup checks for potential problems that might occur while running Setup. If failures occur, select an item in the Status column for more information. Otherwise, select Next.",
               "13.If this is the first installation of SQL Server on the machine, Setup skips the Installation Type page and goes directly to the Feature Selection page. If SQL Server is already installed on the system, you can use the Installation Type page to select either to perform a new installation or to add features to an existing installation. To continue, select Next.",
               "14.On the Feature Selection page, select the components for your installation. For example, to install a new instance of SQL Server Database Engine, select Database Engine Services.",
               "15.A description for each component group appears in the Feature description pane after you select the feature name. You can select any combination of check boxes. For more information, see Editions and components of SQL Server 2016 or Editions and components of SQL Server 2017.",
               "16.The prerequisites for the selected features are displayed in the Prerequisites for selected features pane. Setup installs the prerequisites that aren't already installed during the installation step described later in this procedure.",
               "17.You can also specify a custom directory for shared components by using the field at the bottom of the Feature Selection page. To change the installation path for shared components, either update the path in the field at the bottom of the dialog box or select Browse to go to an installation directory.",
               "18.The default installation path is C:\Program Files\Microsoft SQL Server\nnn\.",
               "19.The Ready to Install page shows a tree view of the installation options that you specified during Setup. On this page, Setup indicates whether the Product Update feature is enabled or disabled and the final update version.",
               "20.To continue, select Install. SQL Server Setup first installs the required prerequisites for the selected features, then it installs the selected features.",
               "21.During installation, the Installation Progress page provides status updates so that you can monitor the installation progress as Setup continues.",
               "22.After installation, the Complete page provides a link to the summary log file for the installation and other important notes.",
               "23.To complete the SQL Server installation process, select Close.",
               "24.If you're instructed to restart the computer, do so now"],
"InstallationLinks":["https://docs.microsoft.com/en-us/sql/database-engine/install-windows/install-sql-server-from-the-installation-wizard-setup?view=sql-server-ver15"],
"Parameters":"server;instance",
"VerificationScripts":["reg.exe query HKLM\\SOFTWARE\\Microsoft\\InetStp /v VersionString"],
Flags:{
"Previous":"False",
"Cancel":"true",
"VerifySoftware":"true"
}
}
